Autodesk.Revit.DB.GeometryAugmentationRegistry.ValidateElement(Autodesk.Revit.DB.Element)
Checks if an element can be used with a geometry augmentation server.
targetElement:
The target element.
Returns:
True is the element can be used with a geometry augmentation server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.GeometryAugmentationRegistry.ValidateServerCanBeDetached(Autodesk.Revit.DB.Element,System.Guid)
Checks if the element has an geometry augmentation server attached.
targetElement:
The target element where the server is attached.
drawingServerGUID:
Geometry server GUID.
Returns:
True if the element has a geometry augmentation server attached. False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.GeometryAugmentationRegistry.ValidateServer(Autodesk.Revit.DB.Element,System.Guid)
Checks if the element supports geometry servers and if the geometry server is valid.
targetElement:
The target element where the server will be attached.
drawingServerGUID:
Geometry server GUID.
Returns:
True if the element supports geometry servers and if the geometry server is valid. False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.GeometryAugmentationRegistry.UnregisterFromServer(Autodesk.Revit.DB.Element,System.Guid)
Removes the association between a drawing server and this element.
targetElement:
The target element where the server is attached.
drawingServerGUID:
Geometry server GUID.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Geometry augmentation servers can't be used in family owned documents.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element does not have a geometry augmentation server attached.
Since:
2024

Autodesk.Revit.DB.GeometryAugmentationRegistry.RegisterToServer(Autodesk.Revit.DB.Element,System.Guid)
Associates this element with a drawing server that will be able to add extra geometry for this element
Remarks:
For view-specific geometry server providers, see Autodesk::Revit::DB::IGeometryAugmentationServer
targetElement:
The target element where the server will be attached
drawingServerGUID:
Geometry server GUID.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Geometry augmentation servers can't be used in family owned documents.
-or-
The target element can't be used with the geometry augmentation system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The GUID provided does not point to any geometry server or the element does not support geometry servers.
Since:
2024

Autodesk.Revit.DB.GeometryAugmentationRegistry
A static class that contains methods for interacting with GeometryAugmentation servers.
This is part of the Geometry Augmentation system implementation.
This class was designed to be public_api but in the end it was decided to be moved to public_api_internal
because an element enhanced with this system created by a third party can't be computed when publish the
rvt file into the cloud.
The computation of the value and graphics is done in generateGrep and if the addon the defines the server is not
present it the cell will be empty.
Decision can be found here:
https://autodesk.slack.com/archives/C02KQUH4519/p1673018478447789
https://wiki.autodesk.com/display/aeceng/Public+availability+of+the+Custom+Graphics+API#decision_framework-1761429744
Since:
2024